Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ཚོགས་པར་མི་འབྱུང་བ། ཤིན་ཏུ་སྨད་པ། རང་བཞིན་གྱི་སྣོད་དུ་མ་གྱུར་པ་དག་སྟེ། སེམས་ཀྱི་རྒྱུད་ཕལ་ཆེར་ཚ་སྒོ་ཅན་ལྟ་བུར་གྱུར་པ། ཕལ་ཆེར་སེམས་ཀྱི་རྒྱུད་སྒོག་སྐྱ་ལྟ་བུར་གྱུར་པ་སེམས་ལ་དམ་པའི་ཆོས་ཀྱིས་བསྒོར་མི་བཏུབ་པ་རྣམས་ཏེ།
en: All the absolute tīrthikas naturally prone to deprecate the Dharma, without serene faith, not found in the assembly, extremely disparaging, and in their nature not receptacles for the Dharma usually have mindstreams like salty soil, usually have mindstreams that have become like white garlic, minds that the good Dharma cannot perfume.

source: དེ་ལྟ་བས་ན་འཇིག་རྟེན་གྱི་ཁམས་འདི་ནི་ཉེས་པ་དེ་ལྔས་སུན་ཕྱུང་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་དེ་ལས་གཞན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྤངས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: So, because this world system has been so corrupted by those five flaws all the other lord buddhas forsake it and awaken to complete awakening in other buddhafields.

source: །བདག་ཅག་གི་དེ་བཞིན་གཤེགས་པ་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་འདི་སྐད་དུ། གཞན་གྱིས་ཡོངས་སུ་སྤངས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཉིད་དུ་བརྩོན་འགྲུས་ཆེན་པོ་དང་། བཟོད་པ་ཆེན་པོ་དང་། ཐབས་མཁས་པ་ཆེན་པོས་སེམས་ཅན་རྣམས་བཏུལ་ནས་དེ་ཉིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་སྟེ།
en: Our own Tathāgata, previously, when engaging in the bodhisattva’s career, made a prayer: “Having with great vigor, great patience, and great skillful means disciplined beings in just that world system others have forsaken, may I awaken fully to unsurpassed, perfect, complete awakening right there.”

source: དེ་བས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཏང་བ་ཡང་བདག་ཅག་གི་དོན་དུ་ཤིན་ཏུ་འོ་བརྒྱལ་བ་སྐུ་ཉམས་སུ་བཞེས་པས་ན་བདག་ཅག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ནོ།
en: So, even though all the other lord buddhas have given it up, for our sake our Lord Buddha accepts a terribly burdensome body. Great, therefore, is his compassion.

source: །སྙིགས་མ་ལྔ་ཞེས་བྱ་བ་ནི་དཔེར་ན་བསྐ་བའི་རོ་དང་ལྡན་པའི་ཁ་ཟས་སྡུག་བསྔལ་གྱི་རྒྱུར་འགྱུར་ཞིང་བཟའ་བའི་འོས་མ་ཡིན་པ་ལྟར་འདི་དག་ཀྱང་དེ་དང་འདྲའོ།
en: These “five degenerations” are, to illustrate, like food with an extremely bitter taste that causes suffering and is inedible.

source: །ཡང་ན་ཇི་ལྟར་སྨན་གྱི་ཚིགས་མ་བསྐ་བ་མར་གྱི་ནང་ནས་ཕྱུང་ནས་དོར་བར་བྱ་བ་སྤྱད་དུ་མི་རུང་བ་དེ་དང་འདྲའོ།
en: Alternatively, they are like the bitter dregs of medicinal herbs extracted from butter that have to be thrown away and are unusable.

source: །ཡང་ན་ངུར་སྨྲིག་ཏུ་བཙོས་པ་ལ་སོགས་པ་ཇི་སྲིད་དུ་ངུར་སྨྲིག་གི་མཐུ་མེད་པར་མ་བྱས་པ་དེ་སྲིད་དུ་ཚོན་གཞན་འཛིན་དུ་མི་རུང་བ་ལྟར་སེམས་ཅན་དེ་དག་ཀྱང་དེ་དང་འདྲ་བས་ན་དེ་དག་གིས་སྙིགས་མ་ཞེས་བྱ་བའི་མིང་དུ་བརྗོད་དོ།
en: Alternatively, those beings are also like cloth boiled in saffron and so on that cannot take another dye for as long as the power of the saffron has not gone. It is because of these [meanings of the word kaṣāya] that they are called “degenerations.”

source: །དེ་ལྟ་བས་ན་འཇིག་རྟེན་ཁམས་འདི་ནི་སྐྱོན་ཆེན་པོ་འདི་ལྟ་བུ་དང་ལྡན་པའི་ཕྱིར་དེར་འདོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་མ་གྲུབ་པ་རྣམས་ལ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་བསྟན་ཅིང་གདམས་པ་མཛད་དོ།
en: So, because this world system has such great flaws, all the buddhas give instructions and advice to bodhisattvas going there who are not yet fully accomplished.

source: །དཔེར་ན་ས་ཆེན་པོ་གཞི་མཉམ་ལ་འགྲོ་བའི་མི་རྣམས་གང་གི་ཚེ། ཚེར་མ་དང་། གྱོ་མོ་དང་། རྡོ་ལ་སོགས་པས་ཉམ་ང་བའི་ས་ཕྱོགས་དེར་ཉེ་བར་འགྲོ་བ་འདིའི་ཚེ་རྗེས་སུ་མ་བསྟན་ན་སྔོན་གྱི་ས་ལ་འགྲོ་བ་འདྲིས་པའི་ཕྱིར་དེ་ཉིད་ཀྱི་ཚུལ་གྱིས་སོང་ན་སྡུག་བསྔལ་ཆེན་པོ་མྱོང་བར་འགྱུར་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཀྱང་དེ་ལྟར་འགྱུར་དུ་དོགས་པའི་ཕྱིར་རྗེས་སུ་བསྟན་པ་མཛད་དོ།
en: To illustrate, if people traveling over a vast flat plain are not warned when approaching an area with dangerous thorns, clods, rocks, and so on, because they are used to the earlier ground they proceed in exactly the same fashion and experience great suffering.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་བསྙེན་པར་དཀའ་བ་ཡིན་ཞེས་བྱ་བའི་ཚིག་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨད་པ་གཙོ་ཆེར་མཛད་པ་མ་ཡིན་གྱི།
en: Similarly, buddhas instruct these bodhisattvas, worried that something like that will happen. The statement that bodhisattvas [born in that Sahā world system] are difficult to approach is not intended mainly as a criticism of those bodhisattvas, but mainly as a criticism of the world system.

source: འཇིག་རྟེན་གྱི་ཁམས་ལ་སྨད་པ་གཙོ་ཆེར་མཛད་པ་ཉིད་དེ།
en: In such a terrible world system as this it is said “even bodhisattvas feel worried.”

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྟ་བུར་ངན་པ་དེར་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་དོགས་པ་སྐྱེས་པར་འགྱུར་རོ་ཞེས་དེ་སྐད་ཐོས་ནས་འདིར་སྐྱེས་པ་རྣམས་སྐྱོ་བར་འགྱུར་ཞིང་དེ་བཞིན་གཤེགས་པ་ལ་ཡང་དད་པ་ཆེར་སྐྱེ་བར་བྱ་བའི་ཕྱིར་རོ། །རིམ་གྲོར་བྱེད། བླ་མར་བྱེད། བསྟི་སྟང་དུ་བྱེད།
en: Having heard that such is the case those born there become disenchanted with this world and feel great faith in the Tathāgata.

source: མཆོད་པར་བྱེད་ཅིང་ཞེས་བྱ་བ་ལ་ཚིག་གིས་བསྟོད་པ་བྱེད་པ་ནི་བསྟི་སྟང་དུ་བྱེད་པའོ། །ཡིད་ཀྱིས་གུས་ཤིང་ཕངས་པར་བྱེད་པ་ནི་བླ་མར་བྱེད་པའོ། །ལུས་ཀྱིས་ཐལ་མོ་སྦྱར་ཞིང་འདུད་པ་དང་། སྐོར་བ་བྱེད་པ་ནི་རི་མོར་བྱེད་པའོ། །མེ་ཏོག་དང་བདུག་སྤོས་ལ་སོགས་པ་མཆོད་པའི་ཡོ་བྱད་རྣམས་ཀྱིས་མངོན་པར་བརྗོད་པ་ནི་མཆོད་པ་བྱེད་པའོ། །གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ།
en: With respected, revered, honored, and worshiped, “to respect” is to verbally praise; “to revere” is to mentally respect and value; “to honor” is to do so physically with folded hands, bowing, and circumambulating; and “to worship” is to bestow material things—flowers, incense, and so on.

source: འཚོ་འམ། སྟོབས་དང་ལྡན་ནམ་བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་བསྙུན་གསོལ་ཞེས་བྱ་བ་ལ། གློ་བུར་གྱི་བསྙུན་མི་མངའ་བས་ན་གནོད་པ་ཆུང་ཞེས་བྱའོ། །རྐྱེན་བཞི་ཤིན་ཏུ་བརྙེས་པའི་ཕྱིར་ཉམ་ང་བ་ཉུང་བ་ཞེས་བྱའོ། །འགྲེས་པ་ལ་སོགས་པས་ཁམས་ཉམ་ཆུང་བ་མེད་པའི་ཕྱིར་དགར་བས་ན་བསྐྱོད་པ་ཡང་བ་ཞེས་བྱའོ།
en: As for inquires about [the Lord’s] health, hopes that [the Lord] is well and free from sickness, alert and buoyant, eating well, strong, and comfortable, he is “well” because he has no sudden illness; is “free from sickness” because of possessing the four conditions; and is “alert and buoyant,” set apart by having a physical constitution not weakened by old age and so on. “

source: །གནོད་པ་ཆུང་བའི་འབྲས་བུ་ནི་འཚོ་བའོ། །ཉམ་ང་བ་ཆུང་བའི་འབྲས་བུ་ནི་སྟོབས་དང་ལྡན་པའོ།།བསྐྱོད་པ་ཡང་བའི་འབྲས་བུ་ནི་བདེ་བ་ལ་རེག་པར་གནས་པའོ།
en: Eating well” is the result of being “well”; being “strong” is the result of being “free from sickness”; and being “comfortable” is the result of being “alert and buoyant.”

source: །འདིར་ཕྱོགས་ལྷག་མ་དགུ་པོ་རྣམས་ཀྱང་ཚུལ་འདི་བཞིན་དུ་བརྗོད་པར་བྱ་སྟེ།
en: Here you should set forth the remaining nine directions in this way.

source: བརྡ་ཕྲད་སླ་བའི་ཕྱིར་འདིར་ནི་མ་སྨོས་སོ།
en: The words and endings are easy so I do not discuss them here.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ་ཞེས་བྱ་བ་ལ། དེར་མང་པོ་ཐམས་ཅད་ལྷགས་ན་གཅིག་པུ་ལ་ཅིའི་ཕྱིར་བཀའ་སྩལ།
en: Presentation of the single vehicle system When the Lord … said to venerable Śāriputra… Question: Why among all the many who have arrived does he speak to him alone?

source: དེ་བཞིན་གཤེགས་པ་ནི་བདག་གི་མདུན་ན་བཞུགས་ཏེ་ཆོས་འཆད་དོ་སྙམ་དུ་སེམས་སོ་ཞེས་གོང་དུ་སྨོས་པ་གང་ཡིན་པ་དེ་དང་ཡང་འགལ་ལོ།
en: It contradicts what has been said above, namely, that they think, “The Tathāgata is seated in front of me explaining the Dharma.”

source: །དེར་འདུས་པ་ཐམས་ཅད་བདག་གཅིག་པུའི་ངོར་གཟིགས་ནས། དེ་བཞིན་གཤེགས་པས་ཆོས་བཤད་དོ་སྙམ་དུ་ཡང་སེམས་ན་གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་ནས་དམིགས་ཀྱིས་གཅིག་ལ་བཀའ་སྩལ་དུ་ཟིན་ན།
en: All those gathered there see the Tathāgata from their own personal perspective and think, “The Tathāgata is explaining the Dharma.”

source: དེའི་ཚེ་འཁོར་གྱི་སེམས་དང་འགལ་བར་ཇི་ལྟར་མི་འགྱུར་ཞེ་ན།
en: If the Lord has singled out one from among them all, and specifically speaks to him, why does this not conflict with the experience of the rest of the retinue?

source: འདིར་སྨྲས་པ།
en: Response: Let me explain.

source: དེ་བཞིན་གཤེགས་པས་ནི་ཐམས་ཅད་ལས་བརྩམས་ནས་ཐམས་ཅད་མངོན་དུ་མཛད་དེ་བཤད་མོད་ཀྱི་འོན་ཀྱང་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པའི་སྐད་ཅིག་ལ་ཐམས་ཅད་ལ་ཡང་བཀའ་སྩལ་པར་འགྱུར་ཏེ།
en: It is true that the Tathāgata manifests and explains everything to everyone. Still, he speaks to Śāriputra, and in that instant he also speaks to all.

source: བཤད་པའི་སྐད་ཅིག་དེ་ལ་ཐམས་ཅད་ལ་ཡང་བཤད་པ་ཐ་དད་པ་རྣམ་པ་སྣ་ཚོགས་མཛད་ན།ཡང་དག་པར་སྡུད་པར་བྱེད་པ་རྣམས་ཀྱིས་རིམ་པ་དེ་ཡང་དག་པར་སྡུད་མི་ནུས་པའི་ཕྱིར་བཤད་པའི་ཡེ་ཤེས་ཀྱི་མཛེས་བརྗིད་བཞག་སྟེ།
en: Insofar as in that one spoken instant he makes all sorts of different statements to all, those who recite the Buddha’s words are not able to recite all the dimensions of the discourse.

source: སྐྱེ་བོ་ཐམས་ཅད་ལ་འོས་པའི་རིམ་པ་གཅིག་བཟུང་ནས་ཡང་དག་པར་བསྡུས་སོ།
en: So, summoning a stupendously brilliant knowledge of the explanation, they have recited it, having taken one dimension of the discourse suited to all the beings.

source: །ཡང་ན་དེ་བཞིན་གཤེགས་པས་ནི་ཤཱ་རིའི་བུ་ཉིད་ལས་བརྩམས་ནས་བསྟན་པས་ཚུལ་འདི་ཉིད་དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པའི་རྒྱུ་ཡིན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་ཀྱང་རྗེས་སུ་གནང་ངོ་། །དེ་བས་ན་ཡང་དག་པར་སྡུད་པར་བྱེད་པ་རྣམས་ཀྱིས་ཀྱང་འདི་ཉིད་ལ་བརྟེན་ནས་ཡང་དག་པར་བསྡུས་སོ།
en: Alternatively, the Tathāgata begins by teaching Śāriputra because just this way causes the good Dharma to last for a long time and therefore the Tathāgata has permitted it.

source: །དེ་ལྟ་ཡིན་དུ་ཟིན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བཤད་པ་མཆོག་བསྟན་པ་ལ་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་བཞག་སྟེ་ཤཱ་རིའི་བུ་ཉིད་ལ་བཀའ་སྩལ་ཅིང་སྐབས་ཕྱེ་ཞེ་ན།
en: So, those who recite the Buddha’s words recite based on just that permission. Qualm: Even so, why, in teaching the supreme explanation of the Bodhisattva Vehicle, does he set aside bodhisattvas and set the scene by speaking to just Śāriputra?

source: དེ་ནི་འདི་ལྟར་གཟུང་བར་བྱ་སྟེ།
en: Response: You should understand this as follows.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཤད་པ་ནི་སྤྱིར་བཤད་པ་ཡིན་གྱི།
en: The perfection of wisdom is a shared discourse.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཉིད་ཀྱི་དོན་དུ་བཤད་པ་ནི་མ་ཡིན་ནོ།
en: It is not a discourse for the sake of just bodhisattvas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། སྒོ་གསུམ་དུ་བཞུགས་པའི་ཕྱིར་རོ།
en: Because the perfection of wisdom exists as all-knowledge, the knowledge of path aspects, the knowledge of all aspects, and the three doors.

source: །དེ་ལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་རུང་བ་ཅིག་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ཏེ་སྐབས་ཕྱེར་ཟིན་ན་འཁོར་གཞན་དག་ཟབ་མོ་འདི་ནི་བདག་ཅག་གི་སྤྱོད་ཡུལ་མ་ཡིན་ནོ་སྙམ་ནས་འབད་པར་མི་བྱེད་ཀྱང་སྲིད་ཀྱི།
en: There, if the Lord had set the scene by addressing any bodhisattva it is possible that others might have thought, “This profundity is not going to be within our range,” and been ill at ease.

source: ཤཱ་རིའི་བུ་ལས་བརྩམས་ཏེ་སྐབས་ཕྱེ་ན་ནི་བཤད་པ་འདི་སྐྱེ་བོ་ཐམས་ཅད་དང་ཐུན་མོང་ཡིན་ཏེ།
en: By setting the scene with Śāriputra, the explanation becomes one shared by all beings.

source: ཤིན་ཏུ་ཟབ་པ་མ་ཡིན་ནོ་སྙམ་དུ་གཞན་དག་སེམས་པར་འགྱུར་རོ།
en: The others think, “This is not too profound.”

source: །དེ་བས་ན་ཤཱ་རིའི་བུ་ཉིད་ལས་བརྩམས་ཏེ་སྐབས་ཕྱེའོ།།
en: So, he sets the scene with Śāriputra.

source: འདི་ལྟར་འོག་ནས་ཀྱང་དགེ་སློང་རྣམས་དང་། འཁོར་གཞན་དག་གིས་ཀྱང་ཆོས་མངོན་པར་རྟོགས་ནས་སོ་སོར་ཐོབ་པོ་ཞེས་འབྱུང་ངོ་།
en: It is similar later on as well, where we find the monks and others in the retinue clearly realizing the Dharma and each reaching their own goals.

source: །དེ་ལ་དེ་ལྟ་ཡིན་དུ་ཟིན་ཀྱང་གནས་བརྟན་ཤཱ་རིའི་བུ་ནི་བྱ་བ་བྱས་པ་ཡིན་པས་བཤད་པ་དོན་ཆེན་པོ་འདི་ལས་བརྩམས་ཏེ་སྐབས་དབྱེ་བ་མི་རིགས་སོ་ཞེ་ན་ཡང་དེ་ལྟར་གནས་བརྟན་ཤཱ་རིའི་བུ་བྱ་བ་བྱས་པ་ཡིན་ནོ་ཞེས་ཟེར་བ་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དམ་པའི་ཆོས་པདྨ་དཀར་པོ་ལས།
en: Qualm: There, even in that case, the venerable Śāriputra is one with his work done, so it is not right to set the scene with him for this discourse that has a great purpose.

source: ཤཱ་རིའི་བུ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། ཚད་མེད་པ་རྣམས་སུ་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་རྣམས་ཀྱི་དམ་པའི་ཆོས་བཟུང་ནས་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱང་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བའི་འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པདྨའི་འོད་ཅེས་བྱ་བར་འགྱུར་ཞིང་འཇིག་རྟེན་དུ་འབྱུང་ངོ་ཞེས་གནས་བརྟན་ཤཱ་རིའི་བུ་སངས་རྒྱས་སུ་འགྱུར་བར་ལུང་བསྟན་ཏོ།
en: Response: Still, in regard to the fact that venerable Śāriputra has thus done his work, The White Lotus of the Good Dharma says: Again, Śāriputra, at a future time, after immeasurable, inconceivable, incalculable eons, when you have learned the good Dharma from many hundred thousand one hundred million billion tathāgatas, have showed devotion in various ways, and completed just this bodhisattva practice, you will become in the world, in the buddhafield called Viraja, a tathāgata, worthy one, perfectly complete buddha called Padmaprabha. Thus, that venerable Śāriputra’s buddhahood was predicted.

source: །ཇི་ལྟར་ན་དགེ་སློང་ཟག་པ་ཟད་པ་ལས་དང་ཉོན་མོངས་པའི་རྒྱུན་ཆད་པ་ཡང་སྲིད་པར་ཉིང་མཚམས་སྦྱོར་ཞིང་བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ། དཔག་ཏུ་མེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་ཏེ། འདི་ཉིད་ཀྱང་ཤེས་པར་མི་རུང་ངོ་།
en: Qualm: How could a monk with outflows dried up, who has cut the continuum of afflictions and karma, link up with another existence and practice this bodhisattva practice for immeasurable, inconceivable eons?

source: །གལ་ཏེ་དགྲ་བཅོམ་པ་རྣམས་ཀྱང་ཡང་སྲིད་པར་ཉིང་མཚམས་སྦྱོར་དུ་ཟིན་ན་ནི་དགྲ་བཅོམ་པ་ཐམས་ཅད་ཀྱང་ཡང་སྲིད་པ་སོ་སོར་ལེན་པར་འགྱུར་བས་ཐར་པ་མི་འགྲུབ་པ་ཉིད་དུ་འགྱུར་རོ་ཞེ་ན།
en: It does not make any sense, because, were even worthy ones to link up with rebirths, then all the worthy ones would be reborn yet again, and the unwelcome consequence would be that they have not achieved liberation.

source: ཡང་འདི་ནི་ངེས་པ་མེད་དེ།
en: Response: This too is not certain.

source: གལ་ཏེ་དགྲ་བཅོམ་པ་རྣམས་ལ་ལས་དང་། ཉོན་མོངས་པ་ཡོད་དུ་ཟིན་ན་ནི་ལས་དང་ཉོན་མོངས་པའི་དབང་གིས་སྲིད་པར་སྐྱེ་བར་ཡང་འགྱུར་ཏེ། ཐར་པ་མི་འགྲུབ་པོ་ཞེས་བྱ་བ་སྨྲ་བ་དེ་ནི་རིགས་ན། ངོ་བོ་ནི་དགྲ་བཅོམ་པ་རྣམས་ལ་ལས་དང་ཉོན་མོངས་པ་ཡོད་ཅིང་། དེས་བྱས་པའི་སྲིད་པར་སྐྱེ་བར་འགྱུར་རོ་ཞེས་ནི་མི་སྨྲའོ།
en: It would be correct to say that were worthy ones to have karma and afflictions they would through the power of karma and afflictions be reborn in suffering existence and would not achieve liberation, but not to say that worthy ones, as worthy ones, have karma and afflictions and will be reborn because of that.

source: །མདོ་གཞན་ལས་འབྱུང་བའི་རིམ་པས་དོན་རྒྱ་ཆེར་བསྟན་པར་བྱའོ།
en: This topic should be explained in detail in the stages found in other sūtras.

source: །འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཁ་ཅིག་ནི་ངེས་པའི་རིགས་ཅན། ཁ་ཅིག་ནི་མ་ངེས་པའི་རིགས་ཅན་ཡིན་པར་ཡང་དག་པར་གཟིགས་སོ།
en: In them, tathāgatas see that some beings are in a lineage that is certain and some in a lineage that is not certain.

source: །དེ་ལ་ངེས་པའི་རིགས་ཅན་གང་ཡིན་པ་དེ་དག་ནི་རིགས་ཀྱི་བྱེ་བྲག་ཉིད་ཀྱིས་དེ་འགྲུབ་པར་བརྗོད་ཀྱང་མི་དགོས་ཀྱི།
en: Among them, there is no need to make a presentation based on distinctions of lineage for those in the lineage that is certain.

source: སེམས་ཅན་མ་ངེས་པའི་རིགས་ཅན་གང་ཡིན་པ་དེ་དག་རྐྱེན་རྙེད་ན་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་བྱང་ཆུབ་གསུམ་གྱི་སྐལ་བ་ཡོད་པར་དེ་བཞིན་གཤེགས་པས་གཟིགས་ནས་དེ་དག་རིམ་གྱིས་སངས་རྒྱས་སུ་བསྒྲལ་བར་བཞེད་ན།
en: Those in the lineage that is not certain meet with certain conditions and in line with those conditions become destined for the three awakenings. The tathāgatas see that and want to deliver them gradually into buddhahood.

source: དེ་དག་ཉོན་མོངས་པ་ཆེ་བ་དང་། དབང་པོ་བརྟུལ་བས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་བཟང་པོ་སྤྱོད་པའི་མཐུ་དང་མི་ལྡན་པར་གཟིགས་ནས་དེའི་ཕྱིར་སེམས་ཅན་དེ་དག་དང་པོར་ཉོན་མོངས་པ་ཉེ་བར་ཞི་བའི་རྒྱུར་གྱུར་པའི་ལམ་ལ་འཇུག་པར་མཛད་དོ། །དེ་བཞིན་ཉིད་དང་།
en: Seeing that they have stronger afflictions and duller faculties and therefore do not have the capacity to practice the bodhisattva’s excellent practices, the tathāgatas, therefore, first lead them onto the path that acts to cause the pacification of afflictions.

source: མྱ་ངན་ལས་འདས་པ་གཉིས་ཐ་མི་དད་པའི་ཕྱིར་དེ་བཞིན་ཉིད་མྱ་ངན་ལས་འདས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་འཛུད་པ་མཛད་དོ།
en: The two, suchness and nirvāṇa, are not different, so the tathāgatas lead them to the realization of suchness-nirvāṇa.

source: །དེ་དག་དེ་ལྟར་བཙུད་ནས་ཀྱང་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་ལ་བསླབས་ནས་རིམ་གྱིས་དེ་བཞིན་ཉིད་མྱ་ངན་ལས་འདས་པ་མངོན་སུམ་དུ་བྱེད་དེ།
en: After they have been led in that way they train in morality, meditative stabilization, and wisdom again and gradually realize suchness-nirvāṇa.

source: དེ་ནི་མཐོང་བའི་ས་ཞེས་ཀྱང་བྱ་བ་ལ། རྒྱུན་ཏུ་ཞུགས་པའི་ལམ་ཞེས་བྱ་བར་ཡང་ཤེས་སོ།
en: This is known as the “Darśana level” and also as the “stream enterer path.”

source: །དེ་ནས་ཡང་འདོད་པ་ལ་འདོད་ཆགས་དང་། གནོད་སེམས་གཉིས་སྤོང་བ་ལ་འཛུད་པ་མཛད་དེ།
en: Then they lead them into eliminating both attachment to sense objects and malice.

source: འཕགས་པ་དེ་དག་གིས་འདོད་པ་ལ་འདོད་ཆགས་དང་། གནོད་སེམས་བསྲབས་པས་དེ་བཞིན་ཉིད་རྟོགས་པར་འགྱུར་ཏེ། དེ་ནི་བསྲབས་པའི་ས་ཞེས་ཀྱང་བྱ་ལ། ལན་ཅིག་ཕྱིར་འོང་བའི་ལམ་ཞེས་བྱ་བར་ཡང་ཤེས་སོ།
en: By refining away their attachment to sense objects and malice, noble beings realize suchness, so this is known as the “Tanū level,” and also as the “once-returner path.”

source: །དེ་ནས་དེ་ཉིད་མ་ལུས་པར་སྤངས་པ་ལ་བཙུད་པས་དེ་བཞིན་ཉིད་རྟོགས་ནས་འདོད་ཆགས་དང་བྲལ་བའི་ས་གསུམ་པ་སྒྲུབ་པར་བྱེད་དོ།
en: Then they lead them to the complete elimination of just that attachment and malice whereby they realize suchness and achieve the third, “Vītarāga level.”

source: དེ་ཉིད་ལ་ཕྱིར་མི་འོང་བའི་ལམ་ཞེས་ཀྱང་བརྗོད་དོ།
en: That is also called the “non-returner’s path.”

source: །དེ་ནས་ཡང་གཟུགས་ཀྱི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་དང་། ང་རྒྱལ་དང་། རྒོད་པ་དང་།
en: Then they further lead them to eliminate the remaining form and formless realm attachment, pride, agitation, and ignorance.

source: མ་རིག་པ་ལྷག་མ་རྣམས་སྤངས་པ་ལ་བཙུད་ནས་དེ་བཞིན་ཉིད་རྟོགས་པ་དེ་ཉིད་ཀྱིས་བྱས་པ་བསྲུང་བའི་ས་རྟོགས་པར་འགྱུར་ཏེ།
en: Just through realizing suchness they realize the “Kṛtāvin level.”

source: དེ་ཉིད་ལ་དགྲ་བཅོམ་པའི་ལམ་ཞེས་ཀྱང་བརྗོད་དོ།
en: That is also called the “worthy one’s path.”

source: །ཐམས་ཅད་ལ་ཡང་དེ་དག་བཙུད་ནས་ཅི་ནས་ཀྱང་སངས་རྒྱས་ཉིད་ལ་འདོད་པ་ཆེན་པོ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: Further, having led them to all those, they teach the Dharma to them in whatever way they can to produce a great desire for buddhahood.

source: །དེ་ནས་སངས་རྒྱས་ཉིད་འདོད་པ་དེ་དག་སངས་རྒྱས་ཉིད་འདོད་པས་བྱས་པ་སྲུང་བ་ཅན་གྱི་ས་ལ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པར་གྱུར་པ་ན་མ་རིག་པའི་བག་ཆགས་ནི་མ་སྤངས་ཏེ།
en: Then on the Kṛtāvin level, those who desire just buddhahood have eliminated all of the afflictions because of their desire for buddhahood, but they still have not eliminated the residual impressions left by ignorance.

source: དེ་མ་སྤངས་པས་ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་ཀྱང་མ་སྤངས་སོ།
en: Because they have not eliminated those, they have not eliminated all the residual impressions left by the afflictions.

source: །དེ་ནས་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བཤད་པ་མཛད་དོ།
en: Then the tathāgatas explain the Bodhisattva Vehicle to them.

source: །བཤད་པ་དེས་ཀྱང་དབང་པོ་ཤིན་ཏུ་སྦྱངས་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ནུས་པའི་བསམ་པ་ཅན་དུ་འགྱུར་ཏེ། རིམ་གྱིས་ཟབ་མོའི་ཆོས་ལ་བཟོད་པ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: That explanation thoroughly purifies their faculties and they become endowed with the intention capable of bringing all the bodhisattva practices to completion, and gradually gain forbearance for the deep dharmas as well.

source: །དེ་ལྟར་སངས་རྒྱས་ཀྱི་ས་ལ་བསམ་པ་ངེས་པ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པ། ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་རྟོགས་པ་ཆོས་ཟབ་མོ་ལ་བཟོད་པ་ཐོབ་པ་ལ་དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་སུ་ལུང་བསྟན་ཏེ།
en: Thus, the tathāgatas predict the buddhahood of those with a fixed intention for the Buddha level who have eliminated all afflictions, who have total realization of the dharma-constituent, and who have gained forbearance for the deep dharmas.

source: དེའི་ཚེ་ན་ས་བརྒྱད་པ་ལ་གནས་པ་རྣམ་པར་མི་རྟོག་པ་ལྷུན་གྱིས་གྲུབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོར་འགྱུར་རོ།
en: From that point on those standing on the eighth level become nonconceptual, effortless great bodhisattvas.

source: །དེ་དག་དེ་ལྟར་གྱུར་པ་དང་ཡང་སྲིད་པ་གཞན་ལེན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བདག་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: When they become like that they appropriate another existence, practice the bodhisattva practices, do the work of maturing beings, and bring their own buddhadharmas to maturity.

source: །ཡང་སྲིད་པ་ཇི་ལྟར་ལེན་ཅེ་ན།
en: How do they appropriate another existence?

source: རྣམ་པ་གཉིས་ཀྱིས་ཏེ། རྐྱེན་གྱི་སྟོབས་དང་། རྒྱུའི་སྟོབས་ཀྱིས་སོ།
en: This has two parts: the power of the condition and the power of the cause.

source: །དེ་ལ་ཉོན་མོངས་པའི་བག་ཆགས་མ་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་ཡང་སྲིད་པར་ཉིང་མཚམས་སྦྱོར་བའི་རྐྱེན་ཡིན་ནོ། །ཟག་པ་དང་བཅས་པའི་དགེ་བའི་རྩ་བའི་རྒྱུ་ལས་བྱུང་བ་ཟག་པ་མེད་པའི་དགེ་བའི་རྩ་བ་དེ་དག་ནི་ཡང་སྲིད་པ་བྱེད་པའི་རྒྱུའོ།
en: Among these, not having eliminated the residual impressions left by the afflictions is the condition for linking up with another existence; the wholesome roots without outflows that have emerged from the causal wholesome roots with outflows are the cause that produces another existence.

source: །དེ་དག་ནི་མདོ་ལས་ཇི་སྐད་འབྱུང་བ་བཞིན་དུ་རིག་པར་བྱ་སྟེ། བློ་གྲོས་རྒྱ་མཚོ་འཁོར་བའི་རྒྱུན་བྱེད་པ་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་དེ་དག་གང་ཞེ་ན། འདི་ལྟ་སྟེ་བསོད་ནམས་ཀྱི་ཚོགས་བཙལ་བས་ཡོངས་སུ་མི་ངོམས་པ་དང་། བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པ་དང་།
en: You should know them from the explanation in a sūtra: “Sāgaramati, what are these afflictions accompanying the wholesome roots that keep saṃsāra going?

source: སངས་རྒྱས་དང་ཕྲད་པར་སྨོན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལ་བརྩོན་པ་དང་། སེམས་ཅན་གྱི་བྱ་བ་ཅི་ཡོད་སྙམ་པ་ལ་སྤྲོ་བ་དང་། ཆོས་འདོད་པའི་བག་ལ་ཉལ་མི་འདོར་བ་དང་།
en: They are never being satisfied with the accumulation of merit, taking up birth in existence having the intention to do so, aspiring to meet with buddhas, not getting depressed when bringing beings to maturity, endeavoring to grasp the good Dharma, being enthusiastic for whatever work beings do, not forsaking thoughts of desire for the Dharma, and not giving up the practice of the perfections.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བ་རྣམས་ཡོངས་སུ་མི་གཏོང་བ་སྟེ། བློ་གྲོས་རྒྱ་མཚོ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་རྣམས་སོ།
en: Sāgaramati, those are the afflictions accompanying the wholesome roots that keep saṃsāra going.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་དག་གིས་ཉོན་མོངས་ཀྱང་ཉོན་མོངས་པའི་སྐྱོན་རྣམས་ཀྱིས་མི་གོས་སོ། །གསོལ་པ།
en: Bodhisattvas are afflicted by them, but they are not stained by the faults of the afflictions.” [

source: བཅོམ་ལྡན་འདས་དེ་དག་དགེ་བའི་རྩ་བ་ལགས་ན། ཅིའི་སླད་དུ་ཉོན་མོངས་པ་རྣམས་ཞེས་བགྱི།
en: Sāgaramati] asked, “Lord, if they are wholesome roots why are they called ‘afflictions’?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟར་ཉོན་མོངས་པ་དེ་ལྟ་བུ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཁམས་གསུམ་ན་ཉོན་མོངས་ལ་ཁམས་གསུམ་པ་ནི་ཉོན་མོངས་པ་ལས་བྱུང་བ་ཡིན་པས་སོ།
en: The Lord said, “Sāgaramati, it is because these sorts of afflictions afflict bodhisattvas in the three realms, and the three realms come about from afflictions.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐབས་མཁས་པ་དང་དགེ་བའི་རྩ་བའི་སྟོབས་བསྐྱེད་པས་བསམས་བཞིན་དུ་ཁམས་གསུམ་ན་ཉོན་མོངས་སོ།
en: Bodhisattvas are afflicted in the three realms intentionally through the power of their skillful means and production of wholesome roots.

source: །དེའི་ཕྱིར་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་ཞེས་བྱ་སྟེ།
en: That is why they are called ‘afflictions accompanying the wholesome roots.’

source: ཁམས་གསུམ་ན་ཉོན་མོངས་པས་དེ་སྐད་བྱའི་སེམས་ཉེ་བར་ཉོན་མོངས་པས་ནི་མ་ཡིན་ནོ།
en: They are afflictions to the extent that they connect them to the three realms, but not because they afflict their minds. “
